test.xml

<?xml version="1.0"?>

<soap:Envelope
    xmlns:soap="http://www.w3.org/2003/05/soap-envelope/"
    soap:encodingStyle="http://www.w3.org/2003/05/soap-encoding">

    <soap:Body xmlns:m="http://www.example.org/stock">
        <m:GetStockPrice>
            <StockName test="attr">  <![CDATA[
      <message> Welcome to TutorialsPoint </message>
   ]]>
            </StockName>
        </m:GetStockPrice>
    </soap:Body>

</soap:Envelope>